from backend.src.chroma_client import ChromaClient
from backend.src.embedder import HFEmbedder, BaseEmbedder
from tqdm import tqdm

# NOTE: EXAMPLE; Run as Module: python -m backend.src.db_initializer

food_collection = [
    "Куркума помогает снизить воспаление в организме.",
    "Шпинат богат железом, что помогает в борьбе с анемией.",
    "Грецкие орехи содержат полезные жирные кислоты, хорошие для сердечно-сосудистой системы.",
    "Ягоды годжи богаты антиоксидантами, которые помогают поддерживать здоровье кожи.",
    "Авокадо содержит здоровые мононенасыщенные жиры, которые полезны для сердца.",
    "Чеснок может помочь снизить уровень холестерина в крови.",
    "Грейпфрут содержит витамин C, который помогает укрепить иммунитет.",
    "Киноа является отличным источником белка и клетчатки.",
    "Лосось богат омега-3 жирными кислотами, которые полезны для мозга и сердца.",
    "Куриные яйца содержат важные питательные вещества, такие как витамин D и холин, хорошие для здоровья мозга.",
    "Морковь богата бета-каротином, который помогает улучшить зрение.",
    "Киви содержит витамин C, который помогает укрепить иммунную систему.",
    "Миндаль является источником витамина E, который полезен для здоровья кожи.",
    "Овсянка богата растворимыми волокнами, которые могут снизить уровень холестерина в крови.",
    "Красные фасоль и боб содержат железо, необходимое для кроветворения.",
    "Лосось содержит омега-3 жирные кислоты, которые помогают поддерживать здоровье сердца.",
    "Спаржа является источником витамина К, который важен для здоровья костей.",
    "Шпинат богат железом и помогает в борьбе с анемией.",
    "Грецкие орехи содержат антиоксиданты, которые могут помочь защитить клетки от повреждений.",
    "Яблоки содержат пектин, который может помочь снизить уровень холестерина в крови.",
    "Авокадо содержит здоровые мононенасыщенные жиры, которые могут помочь снизить риск сердечно-сосудистых заболеваний.",
    "Чеснок содержит алицин, который может помочь снизить уровень кровяного давления.",
    "Малина является богатым источником антиоксидантов, которые могут помочь в борьбе с воспалением.",
    "Куриное мясо богато белком, который необходим для роста и ремонта тканей.",
    "Киноа содержит все важные аминокислоты и является отличным источником белка для вегетарианцев.",
    "Грейпфрут содержит витамин С и антиоксиданты, которые помогают укрепить иммунную систему.",
    "Чай содержит антиоксиданты, которые могут помочь снизить риск развития рака.",
    "Батат содержит бета-каротин, который помогает поддерживать здоровье кожи.",
    "Капуста брокколи содержит витамин К, который помогает в синтезе костной ткани.",
    "Тунец богат белком и омега-3 жирными кислотами, которые помогают поддерживать здоровье сердца.",
    "Кедровые орехи содержат магний, который помогает улучшить функцию мозга.",
    "Семена льна богаты омега-3 жирными кислотами, которые помогают снизить уровень холестерина в крови.",
    "Манго содержит витамин А, который помогает поддерживать здоровье кожи и зрения.",
    "Йогурт содержит пробиотики, которые помогают улучшить пищеварение.",
    "Ананас содержит бромелайн, который может помочь в уменьшении воспаления.",
    "Какао содержит антиоксиданты, которые могут помочь снизить риск сердечно-сосудистых заболеваний.",
    "Кукуруза содержит лицеин, который помогает поддерживать здоровье глаз.",
    "Миндальное масло богато витамином Е, который помогает улучшить здоровье кожи.",
    "Шпинат содержит магний, который помогает укрепить кости и мышцы.",
    "Арбуз содержит лицин, который помогает улучшить здоровье сердца.",
    "Семена чиа являются богатым источником омега-3 жирных кислот, которые помогают улучшить здоровье сердца.",
    "Брокколи содержит витамин С, который помогает поддерживать иммунную систему.",
    "Грейпфрут содержит лицин, который помогает снизить уровень холестерина в крови.",
    "Куриное яйцо является отличным источником белка, который необходим для роста и ремонта тканей.",
    "Картофель содержит калий, который помогает поддерживать здоровье сердца и снизить давление.",
    "Черника содержит антоцианы, которые помогают улучшить зрение.",
    "Оливковое масло содержит мононенасыщенные жиры, которые помогают снизить уровень холестерина в крови.",
    "Курага богата антиоксидантами, которые помогают защитить клетки от повреждений.",
    "Бананы содержат калий, который помогает поддерживать здоровье сердца и нормальный уровень давления.",
    "Гречка является источником растительного белка и помогает улучшить пищеварение.",
    "Говядина содержит железо, которое необходимо для транспортировки кислорода в тканях.",
    "Горох богат растительным белком и помогает снизить уровень холестерина в крови.",
    "Гранат является источником антиоксидантов, которые помогают защитить клетки от повреждений.",
    "Грибы содержат витамин D, который помогает улучшить абсорбцию кальция и поддерживать здоровье костей.",
    "Капуста содержит витамин С, который помогает укрепить иммунную систему.",
    "Картофель содержит клетчатку, которая помогает улучшить пищеварение и предотвратить запоры.",
    "Кешью содержит магний, который помогает улучшить функцию нервной системы.",
    "Кинза является источником антиоксидантов и помогает улучшить здоровье кожи.",
    "Красное вино содержит ресвератрол, который помогает снизить риск сердечно-сосудистых заболеваний.",
    "Лосось содержит витамин D, который помогает укрепить кости и зубы.",
    "Макароны из цельной пшеницы содержат клетчатку, которая помогает улучшить пищеварение.",
    "Маслины содержат мононенасыщенные жиры, которые помогают снизить уровень холестерина в крови.",
    "Мед содержит антибактериальные свойства и помогает укрепить иммунную систему.",
    "Миндаль содержит кальций, который помогает укрепить зубы и кости.",
    "Мясо индейки богато белком и помогает поддерживать здоровье мышц и тканей.",
    "Огурцы содержат воду, которая помогает увлажнить кожу и улучшить пищеварение.",
    "Оливки содержат здоровые жиры, которые помогают снизить риск развития сердечно-сосудистых заболеваний.",
    "Помидоры содержат лицеин, который помогает улучшить зрение.",
    "Пшеничные отруби содержат клетчатку, которая помогает улучшить пищеварение и предотвратить запоры.",
    "Рыбий жир является источником омега-3 жирных кислот, которые помогают улучшить функцию мозга.",
    "Свекла содержит нитраты, которые могут помочь снизить кровяное давление.",
    "Семена подсолнечника богаты селеном, который помогает укрепить иммунную систему.",
    "Спаржа содержит инулин, который помогает улучшить пищеварение и поддерживать здоровье кишечника.",
    "Творог богат белком и кальцием, который помогает укрепить кости и зубы.",
    "Тмин содержит антиоксиданты, которые помогают защитить клетки от повреждений.",
    "Укроп содержит витамин А, который помогает поддерживать здоровье глаз и кожи.",
    "Фасоль содержит растворимые волокна, которые помогают снизить уровень холестерина в крови.",
    "Хурма содержит витамин C, который помогает укрепить иммунную систему.",
    "Цельная каша содержит комплекс углеводов, который помогает улучшить усвоение пищи.",
    "Цветная капуста содержит антиоксиданты, которые помогают защитить клетки от повреждений.",
    "Черная смородина содержит антоцианы, которые помогают улучшить зрение и здоровье кожи.",
    "Черный шоколад содержит флавоноиды, которые помогают улучшить кровообращение и здоровье сердца.",
    "Черри помидоры содержат лицеин, который помогает улучшить зрение.",
    "Шпинат содержит каротиноиды, которые помогают укрепить зрение и здоровье кожи.",
    "Щавель содержит витамин К, который помогает улучшить здоровье костей и свертываемость крови.",
    "Эвкалипт содержит эвкалиптол, который помогает облегчить дыхание и уменьшить воспаление горла.",
]

class ChromaClientInitializer:
    def __init__(self,  host: str='chromadb', port: int=8000,  embedder: BaseEmbedder = HFEmbedder()) -> None:
        self.embedder = embedder
        self.chroma_client = ChromaClient(
            host=host, port=port, 
            embedder = embedder
        )

    def initialize(self, collection: list[str], collection_name: str) -> None:
        collection_name = "food"
        chroma_collection = self.chroma_client.client.get_collection(name=collection_name)

        if chroma_collection.count() == 0:
            print(f"Collection '{collection_name}' is empty. Feeding collection...")
            for item in tqdm(collection, total=len(collection)):
                self.chroma_client.add(item, collection_name=collection_name)
        else:
            print(f"Collection '{collection_name}' is not empty. Skipping feeding...")


if __name__ == "__main__":
    db_initializer = ChromaClientInitializer()
    db_initializer.initialize(collection=food_collection, collection_name="food")


